app/views/pages/home.html.erb

                  <tr>
                    <td><%= @bands.find(g.band_id).band_name %></td>
---
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT 1  [["id", 1]]