app/controllers/pages_controller.rb

	def home
		@bands = Band.all
		@band = Band.find(1)
		@abouts = @band.abouts
		@stories = @band.stories
		@gigs = Gig.all
---
SELECT "bands".* FROM "bands"
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT 1  [["id", nil]]
SELECT "gigs".* FROM "gigs"

	def jdandscott
		@band = Band.find(2)
---
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT 1  [["id", 2]]

	def debris
		@band = Band.find(3)
---
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT 1  [["id", 3]]